tap "epk/epk"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "microsoft/git"
tap "rs/tap"
tap "thoughtbot/formulae"

brew "little-cms2"
brew "protobuf"
brew "automake"
brew "sqlite"
brew "awscli"
brew "boost"
brew "boost-python3"
brew "glib"
brew "python@3.9"
brew "cmake"
brew "cscope"
brew "ctags"
brew "darksky-weather"
brew "delve"
brew "diff-so-fancy"
brew "docker-completion"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "node"
brew "eslint"
brew "fd"
brew "leptonica"
brew "pango"
brew "sdl2"
brew "ffmpeg"
brew "fswatch"
brew "gd"
brew "json-c"
brew "libxml2"
brew "gdal"
brew "gdk-pixbuf"
brew "gh"
brew "ghi"
brew "git"
brew "libcerf"
brew "lua"
brew "gnuplot"
brew "go"
brew "golangci-lint"
brew "jasper"
brew "netpbm"
brew "gts"
brew "graphviz"
brew "grpcurl"
brew "gti"
brew "helm"
brew "htop"
brew "httpie"
brew "hub"
brew "ios-deploy"
brew "oniguruma"
brew "jq"
brew "kompose"
brew "kubernetes-cli", link: false
brew "lazygit"
brew "libmng"
brew "libyaml"
brew "luarocks"
brew "ruby"
brew "macvim"
brew "make"
brew "mas"
brew "openjdk"
brew "maven"
brew "mosh"
brew "neovim"
brew "ninja"
brew "nsq"
brew "nvm"
brew "openssl@3"
brew "php"
brew "postgresql@14"
brew "pstree"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vegeta"
brew "watch"
brew "wdiff"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "rs/tap/jaggr"
brew "rs/tap/jplot"
cask "aws-vault", args: { appdir: "/Applications" }
cask "font-sf-mono-nerd-font"
cask "git-credential-manager-core"
cask "github"
cask "iterm2"
cask "kitty"

mas "1Blocker", id: 1365531024
mas "DaisyDisk", id: 411643860
mas "EyeFriendly", id: 587769990
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "StopTheMadness", id: 1376402589
mas "Super Agent", id: 1568262835
mas "Xcode", id: 497799835
