
tap 'homebrew/cask'
tap 'golangci/tap'
tap 'rs/tap'
tap 'epk/epk'
tap 'microsoft/git'
cask_args appdir: "/Applications"

# Core Homebrew
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'boost'
brew 'boost-python3'
brew 'cairo'
brew 'cmake'
brew 'cscope'
brew 'ctags'
brew 'diff-so-fancy'
brew 'docker-credential-helper'
brew 'docker-credential-helper-ecr'
brew 'fd'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'fswatch'
brew 'gd'
brew 'gdal'
brew 'gdbm'
brew 'gettext'
brew 'ghi'
brew 'git'
brew 'glib'
brew 'gnuplot'
brew 'go'
brew 'golangci-lint'
brew 'graphite2'
brew 'graphviz'
brew 'gti'
brew 'gts'
brew 'harfbuzz'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'jaggr'
brew 'jasper'
brew 'jemalloc'
brew 'jpeg'
brew 'jplot'
brew 'jq'
brew 'kompose'
brew 'kubernetes-cli'
brew 'helm'
brew 'lazygit'
brew 'libcerf'
brew 'libevent'
brew 'libffi'
brew 'libidn2'
brew 'libpng'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libyaml'
brew 'lua'
brew 'lzo'
brew 'make'
brew 'mas'
brew 'maven'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'node'
brew 'nsq'
brew 'oniguruma'
brew 'openssl'
brew 'openssl@1.1'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'protobuf'
brew 'pstree'
brew 'pv'
brew 'python@3'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'qt'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'sqlite'
brew 'telnet'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unibilium'
brew 'vegeta'
brew 'watch'
brew 'wdiff'
brew 'webp'
brew 'wget'
brew 'xz'
brew 'zlib'
brew 'zsh'
brew 'ripgrep'

# Cask Apps
cask 'aws-vault'
cask 'sloth'
cask 'font-sf-mono-nerd-font'
cask 'git-credential-manager-core'
